Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: o The range of 0xFE000000 to 0xFEFFFFFF is to be used in conjunction with locally assigned channels.
ja: o 0xFE000000 から 0xFEFFFFFF の範囲は, ローカルに割り当てられたチャンネルと共に利用されるためにある.

source: This Textual Convention SHOULD NOT be used directly in object definitions since it restricts addresses to a specific format.
ja: このテキスト表記は, アドレスを特定の形式に制限するので, オブジェクト定義で直接利用しないほうがよい.

source: Thus, providing the option not to check the server host key is
ja: それゆえ, ホスト鍵のチェックをしない選択肢は, インターネット全体のセキュリティを向上すると考えている. たとえ, この選択肢を許容する設定ではプロトコルのセキュリティが低下するとしてもだ.

source: For this purpose, the GSS-API mechanism-independent name form for host-based services is used, as described in Section 4.1 of [GSSAPI].
ja: この目的のため, ホストベースサービスでの GSS-API メカニズムに独立な名前の形式が用いられる. [GSSAPI] の 4.1 節に記述されている.

source: These numbers are allocated as follows.
ja: 以下のように番号が割り当てられる.

source: X11 channels are opened with a channel open request.
ja: X11 のチャンネルは, チャンネル開始要求で開始される.

source: This allows new protocols to be defined and coexist with the protocols listed above.
ja: これは, 上に挙げたプロトコルと共存する, 新しいプロトコルが定義されることを許している.

source: Operators have reported that having to deploy another user and key-management infrastructure in order to use SNMPv3 is a reason for not deploying SNMPv3.
ja: SNMPv3 を配置しない理由として, SNMPv3 を利用するには既存のものとは別のユーザと鍵管理基盤を配置する必要があるという報告が運用者からされている.

source: Extensibility
ja: 拡張性

source: C generates a random number x, where 1 < x < (p-1)/2.
ja: C は 1 < x < (p-1)/2 な乱数 x を生成する.

source: The recipient will respond to this message with SSH_MSG_REQUEST_SUCCESS or SSH_MSG_REQUEST_FAILURE if 'want reply' is TRUE.
ja: 受け取り手はこのメッセージに対して, SSH_MSG_REQUEST_SUCCESS か, 'want_reply' が TRUE の SSH_MSG_REQUEST_FAILURE で返答する.

source: o Added text for NETCONF username handling following the requirements on usernames in [RFC6241].
ja: o [RFC6241] のユーザ名の要件に従う NETCONF ユーザ名の扱いについて追記した.

source: The "ssh-rsa" key format has the following specific encoding:
ja: "ssh-rsa" 鍵フォーマットは次のエンコーディングを持つ:

source: "A" means the single character A, ASCII 65).
ja: "A" は, 単一の文字 A ASCII 65を意味する).

source: Connection Protocol .......................................24 9.5.1.
ja: コネクション プロトコル ....................................24 9.5.1.

source: Implementation Notes .......................................2 2.3.
ja: 実装上の注意 .......................................2 2.3.

source: Alternatively, it may be some attempt at providing something practical and immediately useful to the administrators of the system so they don't have to put in much effort to get SSH working.
ja: もしくは, システムの管理者がSSHを動作させるのに労力を払わずにすむように, デフォルトのポリシーが管理者にとって実際的ですぐに利用可能であろうと試みられているかもしれない.

source: Objects in this MIB module are arranged into subtrees.
ja: この MIB モジュールのオブジェクトは, 部分木中に配置される.

source: If two sessions have the same session id (hash of key exchanges), then packets from one can be replayed against the other.
ja: 2つのセッションが同じセッション識別子(鍵交換のハッシュ)を持った場合, 一方からのパケットはもう一方に対してリプレイされる.

source: For example, an observer may guess that a user's password has expired, and with further observation may be able to determine the password lifetime imposed by a site's password expiration policy.
ja: 例えば, 観察者は, ユーザのパスワードが期限切れかどうか推測できるかもしれない. さらなる観察により, サーバのパスワード期限ポリシーで決められたパスワードの生存期間を決定できるかもしれない.

source: When a server sends this message, it MUST be followed by an SSH_MSG_USERAUTH_FAILURE message, which is to be interpreted as applying to the same authentication request.
ja: このメッセージをサーバが送るとき, 同じ認証リクエストに対して適用されるように解釈されるために, SSH_MSG_USERAUTH_FAILURE を続けて送らなければならない.

source: For example, "ssh-dss" specifies SHA-1 hashing.
ja: たとえば, 'ssh-dss' は SHA-1 ハッシュを指定する.

source: To avoid unnecessary processing and user interaction, the following message is provided for querying whether authentication using the "publickey" method would be acceptable.
ja: 不必要な処理とユーザとの対話を避けるため, "publickey" 認証法を用いた認証が受け入れられるかどうかを尋ねるために, 以下のメッセージが提供されている.

source: The server responds with:
ja: サーバは以下で応答する.

source: User authentication is done via the SSH_MSG_USERAUTH_REQUEST messages (see Section 5).
ja: ユーザ認証は, SSH_MSG_USERAUTH_REQUEST メッセージにより実施される (5 節を参照).

source: This document specifies new cipher algorithms for SSH that follow this recommendation.
ja: この文書では, この推奨に従う新しい暗号アルゴリズムをSSHに定義する.

source: Each time the server's call to GSS_Accept_sec_context() returns a major_status code of GSS_S_CONTINUE_NEEDED, it sends the following reply to the client:
ja: GSS_Accept_sec_context() のサーバでの呼び出しが major_status コードとして GSS_S_CONTINUE_NEEDEDを返すたびに, サーバは以下の応答をクライアントに送る:

source: This method performs user authentication by making use of an existing GSS-API context established during key exchange.
ja: この方法は, 鍵交換で確立された既存の GSS-API コンテキストを利用してユーザ認証を行なう.

source: Denial of service attacks of this type (wire cutter) are almost impossible to avoid.
ja: この種のサービス妨害攻撃(ワイヤカッター)はほぼ避けられない.

source: The Disconnection Message 'reason code' gives the reason in a more machine-readable format (suitable for localization), and can have the values as displayed in the table below.
ja: 切断メッセージの 'reason code' は, (地域化に適した)より機械よりの形式で理由を提供する. 以下の表で示す値を持つ.

source: Re-exchange is processed identically to the initial key exchange, except for the session identifier that will remain unchanged.
ja: 再交換は, セッション識別子が変更されないことを除くと, 最初の鍵交換と同様に処理される.

source: The NETCONF protocol [RFC4721] is an XML-based protocol used to manage the configuration of networking equipment.
ja: NETCONF プロトコル [RFC4721] は, ネットワーク機器の設定を管理するのに使われる XML ベースのプロトコルだ.

source: All of these channels are multiplexed into a single encrypted tunnel.
ja: これらのチャンネルすべては, 単一の暗号化されたトンネルに多重化される.

source: This document adds the following elliptic curve cryptography algorithms to the Secure Shell arsenal: Elliptic Curve Diffie-Hellman (ECDH) and Elliptic Curve Digital Signature Algorithm (ECDSA), as well as utilizing the SHA2 family of secure hash algorithms.
ja: この文書は, 次の楕円曲線アルゴリズムを セキュアシェルの機能に加える: 楕円曲線 Diffie-Hellman (ECDH) , 楕円曲線 Digital Signature Algorithm (ECDSA). また, 安全なハッシュアルゴリズムのSHA2ファミリの利用も加える.

source: If the server does not support the requested language, the language to be used is implementation-dependent.
ja: サーバが要求された言語をサポートしてないなら, 利用される言語は実装依存だ.

source: o The User Authentication Protocol [SSH-USERAUTH] authenticates the client-side user to the server.
ja: o ユーザ認証プロトコル [SSH-USERAUTH] は, クライアント側のユーザをサーバに認証する.

source: All message numbers used by this authentication protocol are in the range from 50 to 79, which is part of the range reserved for protocols running on top of the SSH transport layer protocol.
ja: 認証プロトコルで利用されるすべてのメッセージ番号は, 50から79の範囲にある. この範囲は, SSHトランスポート層プロトコルの上で動作するプロトコルのために予約された範囲の一部だ.

source: The ECMQV key exchange method is OPTIONAL.
ja: ECMQV 鍵交換法は選択できる.

source: So, NETCONF requires communications channels that provide strong encryption for data privacy.
ja: それゆえ, NETCONF は, データの秘密性に対して強い暗号化を提供する通信チャンネルを要求する.

source: A response SHOULD NOT be sent to this message.
ja: このメッセージに対しては返答を送らないほうがよい.

source: [500 ms passes, no ACK]
ja: [500 ms 経過し, ACKが返ってこない]

source: This document describes the use of an SSH Subsystem for SNMP to make SNMP usage distinct from other usages.
ja: この文書は, 他のシステムの利用と SNMP の利用を区別する SNMP のための SSH サブシステムの利用を記述している.

source: Some key types may not support both signing and encryption.
ja: 鍵の種類の中には, 署名と暗号化の両方をサポートしないものがある.

source: [SSH-GCM] describes how AES Galois/Counter Mode is to be used in Secure Shell.
ja: [SSH-GCM] は, セキュアシェルでAES Galois/カウンタモードがどのように用いられるかを記述している.

source: The Status Message .
ja: 状態メッセージ .

source: Additional methods may be defined, as specified in [SSH-ARCH] and in [SSH-NUMBERS].
ja: 追加の方法が, [SSH-ARCH] や [SSH-NUMBERS] で定義されるかもしれない.

source: As this document provides new functionality within the Secure Shell protocol architecture, the only impact on network operations is the impact on existing Secure Shell implementations.
ja: この文書はセキュアシェルプロトコルアーキテクチャに新しい機能を追加しているので, ネットワーク操作への影響は, 既存のセキュアシェル実装の影響と同一だ.

source: Public Key Subsystem Request Names .
ja: 公開鍵サブシステムの要求名 .

source: Both sides MUST start a connection by sending a version packet that indicates the version of the protocol they are using.
ja: クライアントもサーバも, 利用するプロトコルのバージョンを指定するバージョンパケットを送って接続を開始しなければならない.

source: Properties of Galois Counter Mode ...............................3 4.1.
ja: Galois カウンタモードの特性 ...............................3 4.1.

source: Once the server has responded to the request message with an SSH_MSG_USERAUTH_PK_OK message, the client uses a second SSH_MSG_USERAUTH_REQUEST message to perform the actual authentication:
ja: サーバが, SSH_MSG_USERAUTH_PK_OK メッセージで要求メッセージに対して応答したら, クライアントは2番目の SSH_MSG_USERAUTH_REQUEST を用いて実際の認証を行なう.

source: The value of 'request name' follows the DNS extensibility naming convention outlined in [SSH-ARCH].
ja: 'request name' の値は, [SSH-ARCH] で説明されているDNS 拡張命名規則に従う.

source: Connection Protocol Assigned Names ........................14 4.9.1.
ja: コネクションプロトコルに割り当てられる名前............14 4.9.1.

source: Not all of these characters are supported on all systems.
ja: これらの文字すべてが, すべてのシステムでサポートされているわけではない.

source: Systems supporting non-ASCII passwords SHOULD always normalize passwords and usernames whenever they are added to the database, or compare them (with or without hashing) to existing entries in the database.
ja: ASCII以外のパスワードをサポートするシステムは, パスワードとユーザ名をデータベースに追加したり(ハッシュしたり,もしくはせずに)データベース内のエントリと比較する際にいつでも正規化する必要がある.

source: Overview
ja: 概説

source: There are no management objects defined in this MIB module that have a MAX-ACCESS clause of read-write and/or read-create.
ja: read-write および/または read-create の MAX-ACCESS 条項を持つ, このMIB モジュールで定義された管理オブジェクトはない.

source: The IANA will not assign Extended Channel Data Transfer 'data_type_code' values in the range of 0xFE000000 to 0xFFFFFFFF.
ja: IANAは, 0xFE000000 から 0xFFFFFFFF の範囲の 拡張チャンネルデータ転送の 'data_type_code' の値は割り当てない.

source: Line Termination Characters
ja: 行終端文字

source: Note that when this message is sent to the server, the client has not yet prompted the user for a password, and so that information is NOT included with this initial message (unlike the "password" method).
ja: このメッセージがサーバに送信される時, クライアントはまだユーザにパスワードのためのプロンプトを出しておらず, ("password" 法とは異なり) この最初のメッセージにはパスワードのような情報は含まれていない.

source: However, this assumption is not correct.
ja: しかし, この仮定は正しくなかった.

source: This document requires that servers default to allowing access to the "netconf" SSH subsystem only when using a specific TCP port assigned by IANA for this purpose.
ja: この文書は, この目的のために IANA に割り当てられた特定の TCP ポートのみで "netconf" SSH サブシステムへのアクセスを許すのをデフォルトとするようサーバに要求する.

source: So long as the "none" MAC is not used, this protocol provides data integrity.
ja: "none" MAC が利用されない限り, このプロトコルはデータの完全性を提供する.

source: The server should return the smallest group it knows that is larger than the size the client requested.
ja: サーバは, サーバが持っている群の中でクライアントが要求したサイズよりも大きいもののうちもっとも小さいサイズの群を返す必要がある.

source: GSS-API User Authentication
ja: GSS-API ユーザ認証

source: Presentation Format of the SSHFP RR
ja: SSHFP RR の 表示形式

source: When the NETCONF server processes a <close-session> operation, the NETCONF server SHALL respond and close the SSH session channel.
ja: NETCONF サーバが <close-session> 操作を処理する場合は, NETCONF サーバは応答し SSH のセッションチャンネルを終了することになる.

source: Additional 'method name' values may be defined as specified in [SSH-ARCH] and [SSH-NUMBERS].
ja: 追加の 'method_name' の値が, [SSH-ARCH] や [SSH-NUMBERS] で定義されるかもしれない.

source: However, with modern modems, the time needed to transfer is in the order of 2 milliseconds, which is a lot faster than people can type.
ja: しかし, 現在のモデムは転送にかかる時間は2ミリ秒のオーダで, 人間がタイプできる速度よりもかなり早い.

source: Each category of names listed above has a separate namespace.
ja: 上で挙げられたどの名前のカテゴリも, 別々の名前空間を持つ

source: This document should be read only after reading the SSH architecture document [SSH-ARCH] and the SSH authentication document [SSH-USERAUTH].
ja: この文書は, SSH アーキテクシャ文書 [SSH-ARCH] と SSH 認証文書 [SSH-USERAUTH] を読んでからのみ読むべきだ.

source: The output of the algorithm is presented to the user as a sequence of 16 octets printed as hexadecimal with lowercase letters and separated by colons.
ja: アルゴリズムの出力は, 小文字でコロンで区切られた16進数で表示される 16 オクテットの並びとして, ユーザに提示される.

source: The EOM sequence can cause operational problems and open space for attacks if sent deliberately in RPC messages.
ja: EOM 文字列は, 操作の問題を引き起す可能性がある. また, 意図的に送信さらた RPC メッセージよって攻撃を受ける可能性がある.

source: The ecc_key_blob value has the following specific encoding:
ja: ecc_key_blob の値は, 次のエンコーディングを持つ:

source: "x11" specifies that X11 forwarding may not be performed when this key is in use.
ja: "x11" はこの鍵を用いるとX11転送が実行されないことを指定する.

source: Consequently, even though the methods described herein come with proofs of security, developers must still execute caution when developing applications that implement these methods.
ja: 結果として, この文書で記述した方法にセキュリティの証明があっても, これらの方法を実装したアプリケーションを開発する際には開発者は慎重に実行しなければならない.

source: The client then verifies the host key as described in Section 8 of [RFC4253].
ja: そして, [RFC4253] の 8節に記述されているように, クライアントはホスト鍵を検証する.

source: There are no mitigating factors for this.
ja: これを緩和する要素はない.

source: It is assumed that practitioners will first attempt to use the IANA- assigned 'reason code' values and then document their locally assigned 'reason code' values.
ja: 実行する者が, まずIANAで割り当てられた 'reason code' を利用しようとし, その次にローカルに割り当てられた 'reason code' を利用しようとすることを前提としている.

source: SSH implementations that both store the passwords and compare them SHOULD use [RFC4013] for normalization.
ja: パスワードを保存したり比較するSSHの実装は, 正規化に[RFC4013]を使う必要がある.

source: SSH Subsystem ......................................11 3.2.
ja: SSH サブシステム ......................................11 3.2.

source: SSH_MSG_USERAUTH_FAILURE with partial success - The password has been changed, but more authentications are needed.
ja: SSH_MSG_USERAUTH_FAILURE with partial success - パスワードは変更された. さらなる認証が必要だ.

source: Forwarded TCP/IP channels are independent of any sessions, and closing a session channel does not in any way imply that forwarded connections should be closed.
ja: 転送されたTCP/IPチャンネルは他のセッションとは独立だ. またセッションチャンネルが終了しても, 転送された接続が閉じられることを意味しない.

source: SSH implementations which maintain private user databases SHOULD prepare user names as described by [SASLPREP].
ja: 秘密のユーザデータベースを維持するSSHの実装は [SASLPREP] に記述されているようにユーザ名を前処理しなければならない．

source: First SSH_MSG_USERAUTH_REQUEST Message
ja: 最初の SSH_MSG_USERAUTH_REQUEST メッセージ

source: IANA Considerations ...........................................33 11.
ja: IANA の考慮 ...........................................33 11.

source: For the SSH Transport Model, transport type and address are configured in the snmpTargetAddrTable, and the securityName and securityLevel parameters are configured in the snmpTargetParamsTable.
ja: SSH トランスポートモデルに対して, トランスポートのタイプとアドレスは, snmpTargetAddrTable で設定される. そして, securityName と securityLevel パラメータは snmpTargetParamsTable で設定される.

source: In addition, deleg_req_flag MAY be set to "true" to request access delegation, if requested by the user.
ja: 加えて, ユーザが求めるならば アクセスの委譲を要求するために deleg_req_flag を "true" に設定してもよい.

source: If there is no session corresponding to tmSessionID, then closeSession processing is complete.
ja: tmSessionID に対応するセッションがなければ, closeSession() 処理は完了する.

source: Note that the last stage of RSAES-OAEP-ENCRYPT is to encode an integer as an octet string using the I2OSP primitive of [RFC3447].
ja: 注意: RSAES-OAEP-ENCRYPT の最終段階は, [RFC3447] の I2OSP プリミティブを用いてオクテット文字列として整数をエンコードする.

source: Of course, if the DH private parameters for the client and server are revealed, then the session key is revealed, but these items can be thrown away after the key exchange completes.
ja: もちろん, クライアントやサーバのDHの秘密のパラメータが漏れたら, セッション鍵が漏れる. しかし, これらのパラメータは鍵交換が終わると捨てられる.

source: The format of the SSH_MSG_USERAUTH_INFO_RESPONSE message is as follows:
ja: SSH_MSG_USERAUTH_INFO_RESPONSE の形式は次のとおり:

source: Arbitrary length binary string.
ja: 任意の長さのバイナリ文字列.

source: The server SHOULD respond with SSH_MSG_CHANNEL_FAILURE if the user is not allowed access to the Public Key Subsystem (for example, because the user authenticated with a restricted public key).
ja: (例えば制限された公開鍵でユーザが認証したため) 公開鍵サブシステムにアクセスをユーザが許されていない場合も, SSH_MSG_CHANNEL_FAILUREをサーバは返す必要がある.The server SHOULD respond with SSH_MSG_CHANNEL_FAILURE if the user is not allowed access to the Public Key Subsystem (for example, because the user authenticated with a restricted public key).

source: We note that, in addition to protecting the first-time transfer of host keys, SSHFP can optionally be used for stronger host key protection.
ja: SSHFPは, ホスト鍵の最初の転送の保護に加えて, より協力なホスト鍵の保護にもなることをここで言及しておく.

source: Upon reception of the <hello> message, the receiving peer's SSH Transport layer conceptually passes the <hello> message to the Messages layer.
ja: <hello> メッセージを受信したら, 受け取ったピアの SSH トランスポート層は Messages 層に <hello> メッセージを概念的に渡す.

source: The overall structure and assignment of objects to their subtrees, and the intended purpose of each subtree, is shown below.
ja: 全体的な構造と部分木へのオブジェクトの割り当て, それぞれの部分木の目的は後述する.

source: SSH_MSG_USERAUTH_FAILURE without partial success - The password has not been changed.
ja: SSH_MSG_USERAUTH_FAILURE without partial success - パスワードは変更されなかった.

source: Note that this method provides no confidentiality protection, and it is NOT RECOMMENDED.
ja: この方法は機密性の保護を提供しないことに注意. そしてこの方法は推奨されない.

source: Compliant implementations MUST ignore headers with unrecognized header-tags.
ja: この文書に準拠する実装は, 認識できない header-tag を持つヘッダを無視しなければならない.

source: Protocol packets have message numbers in the range 1 to 255.
ja: プロトコルのパケットは, 1から255の範囲のメッセージ番号を持つ.

source: The client obtains the information from the user and then responds with an SSM_MSG_USERAUTH_INFO_RESPONSE message.
ja: クライアントはユーザから情報を得て, SSM_MSG_USERAUTH_INFO_RESPONSE で応答する.

source: The responses MUST be ordered as the prompts were ordered.
ja: responses は, prompts の順番で並んでなければならない.

source: Confidentiality and Data Integrity of SSH Binary Packets
ja: SSH バイナリパケットの機密性とデータ完全性

source: Signature Encoding .
ja: 署名のエンコーディング .

source: If there is no confidentiality or no MAC, password change SHOULD be disabled.
ja: 機密性やMACがない場合には, パスワードの変更は無効とされる必要がある.

source: When calling GSS_Init_sec_context(), the client MUST set integ_req_flag to "true" to request that per-message integrity protection be supported for this context.
ja: クライアントがGSS_Init_sec_context() を呼ぶ際， このコンテキストでメッセージ単位の完全性保護のサポートを要求するため， integ_req_flag を "true" に設定しなければならない．

source: This MIB module provides management of the Secure Shell Transport Model.
ja: この MIB モジュールは セキュアシェルトランスポートモデルの管理を提供する.

source: Since the key exchange process authenticates only the host, the setting of anon_req_flag is immaterial to this process.
ja: 鍵交換プロレスはホストのみ認証するので, anon_req_flag の設定は重要ではない.

source: Procedures for Sending an Outgoing Message
ja: 送信メッセージのための手順

source: If a server sends both this message and an SSH_MSG_KEXGSS_ERROR message, the SSH_MSG_KEXGSS_ERROR message MUST be sent first, to allow clients to record and/or display the error information before processing the error token.
ja: このメッセージと SSH_MSG_KEXGSS_ERROR メッセージの両方をサーバが送る場合は, エラートークンの処理の前にクアイアントがエラー情報を記録したり表示したりできるように, SSH_MSG_KEXGSS_ERROR メッセージを先に送らなければならない.

source: The Header-tag MUST NOT be more than 64 8-bit bytes and is case- insensitive.
ja: Header-tag は, 64 8-bit バイトを越えてはならず, 大文字小文字を区別しない.

source: GSS-API Session ...........................................15 3.5.
ja: GSS-API セッション ...........................................15 3.5.

source: Relationship to Other MIB Modules .........................21 6.3.1.
ja: 他のMIB モジュールとの関係 .........................21 6.3.1.

source: This key exchange method provides explicit server authentication as defined in Section 7.
ja: この鍵交換法は, 7節で定義した 明示的なサーバ認証を提供する.

source: Many estimates consider that 2^80-2^90 operations are beyond feasible, so that would suggest using elliptic curves of at least 160-180 bits.
ja: 多くの見積りが2^80-2^90の操作が実行可能な線を越えているとみなしている. これは少なくとも160-180 ビットの楕円曲線の利用を示唆している.

source: Procedures for an Incoming Message
ja: 受信メッセージのための手順

source: Conceptually, the SSH Transport layer passes any data found in between the ]]>]]> characters to the Messages layer.
ja: 概念的には, SSH トランスポート層は, Messages 層に ]]>]]> の間のすべてのデータを渡す.

source: Confidentiality
ja: 機密性

source: End-of-Message Framing Mechanism
ja: メッセージ終了文字列を用いるフレーミングメカニズム

source: If the recipient does not recognize or support the request, it simply responds with SSH_MSG_REQUEST_FAILURE.
ja: 受け取り手が要求を理解しなかったりサポートしない場合は, 単にSSH_MSG_REQUEST_FAILURE を返す.

source: The assumption stated above, that the Authentication Protocol only runs over a secure transport that has previously authenticated the server, is very important to note.
ja: 認証プロトコルはサーバを認証済みの安全なプロトコル上で働くという前述した仮定は, 非常に重要なので注記する.

source: Specifically, for the case of the Authentication Protocol, the client may form a session to a man-in-
ja: 特に, 認証プロトコルの場合は, クライアントが中間者攻撃用のデバイスとセッションを作るとユーザ名やパスワードといったユーザの認証資格を漏らしてしまう.

source: Normally, the server responds to this message with success or failure.
ja: 通常, サーバはこのメッセージに対して成功ないし失敗のメッセージで応答する.

source: Both AEAD_AES_128_GCM and AEAD_AES_256_GCM produce a 16-octet Authentication Tag ([RFC5116] calls this a "Message Authentication Code").
ja: AEAD_AES_128_GCM と AEAD_AES_256_GCM の両方とも 16-オクテットの認証タグを生成する ([RFC5116] は "Message Authentication Code" とこれを呼ぶ).

source: Status responses have status codes in the range 0 to 255.
ja: 状態の応答は 0から255までの状態コードを持つ.

source: The DESCRIPTION clause of TransportAddress objects that may have snmpSSHAddress values must fully describe how (and when) such names are to be resolved to IP addresses and vice versa.
ja: snmpAddress の値を持つことがある TransportAddress オブジェクトの DESCRIPTION 項は, それらの名前は IPアドレスにどのように(またいつ)解決されたか, またその逆の解決について完全に記述しなければならない.

source: The client SHOULD ignore these messages.
ja: クライアントはこれらのメッセージを無視する必要がある.

source: If the current block is not a stored block, one or more empty blocks are added after the current block to ensure that there are at least 8 bits, counting from the start of the end-of-block code of the current block to the end of the packet payload.
ja: もし, 現在のブロックが保存されたブロックではない場合, 現在のブロックのブロック終了コードの始まりからパケットの payload の終わりまでが少なくとも8bit単位であることを保証するために現在のブロックのあとで1つかそれ以上のブロックが追加される.

source: This document defines a NETCONF over SSH mapping that provides for support of strong encryption and authentication.
ja: この文書は, 強い暗号化と認証のサポートを提供する SSH マッピング上の NETCONF を定義する.

source: First Rekeying Recommendation
ja: 鍵の再生成についての1番目の推奨

source: In fact, as described below, it has the potential to result in the use of a weaker method than desired.
ja: 以下に記述するように, 望まれているものよりも弱い方法を用いてしまう可能性が実際にある.

source: Each side has a preferred algorithm in each category, and it is assumed that most implementations, at any given time, will use the same preferred algorithm.
ja: それぞれの側が, それぞれのカテゴリについて優先するアルゴリズムがある. そして, ほとんどの実装で, 常に同じ優先のアルゴリズムを用いると仮定できる.

source: The "twofish128-cbc" cipher is the same as above, but with a 128-bit key.
ja: "twofish128-cbc" 暗号は, 同様の暗号だが, 128-bit の鍵を使う.

source: Public Key Subsystem Status Codes
ja: 公開鍵サブシステムの状態コード

source: Extended Channel Data Transfer data_type_code and Data .....9 4.4.1.
ja: 拡張チャンネルデータ転送の data_type_code と data.....9 4.4.1.

source: The SSH user identity is provided to the Transport Model, so it can be used to map to an SNMP model-independent securityName for use with SNMP access control and notification configuration.
ja: SSH ユーザの識別情報はトランスポートモデルに提供され, SNMP アクセス制御と通知設定で利用する SNMP モデルに独立な securityName へマップするにに利用できる.

source: Protocol packets containing the SSH_MSG_DISCONNECT message MUST have Disconnection Message 'reason code' values in the range of 0x00000001 to 0xFFFFFFFF.
ja: SSH_MSG_DISCONNECT メッセージを含むプロトコルのパケットは, 0x00000001 から 0xFFFFFFFF の範囲の切断メッセージの 'reason code' を持たなければならない..

source: This approach allows client software to take on the burden of this configuration.
ja: このアプリートでは, クライアントソフトウェアがこの設定に対する負担を引き受ける.
